УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_Договоры/КонтурЛогистика_Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Договоры</name>
  <attributes>
    <name>Организация</name>
    <comment>Организация к которой относится договор Можно заполнить как организацию так и Организацию ИНН</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияИНН</name>
    <comment>Можно заполнить как организацию так и Организацию ИНН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>с какой организацией заключен договор</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИНН</name>
    <comment>Можно заполнить как Контрагента так и Контрагент ИНН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <comment>Номер договора</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <comment>Дата договора</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведения</name>
    <comment>необязательно, Дополнительные сведения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдДок</name>
    <comment>Идентификатор файла документа (в том числе регистрационный номер, если документ / сведения о таком документе содержатся в государственных информационных системах)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Участник</name>
      <comment>Заполняется или УчастникИНН ил  Участник</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>УчастникИНН</name>
      <comment>Заполняется или УчастникИНН ил  Участник</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_Договоры/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		
		Если ЗначениеЗаполнено(НомерДокумента) И ЗначениеЗаполнено(ДатаДокумента) Тогда
			Наименование = НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		ИначеЕсли ЗначениеЗаполнено(ИдДок) Тогда
			Наименование = ИдДок;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрДлина(СокрЛП(ОрганизацияИНН)) <> 10 И СтрДлина(СокрЛП(ОрганизацияИНН)) <> 12 Тогда 
		Если ЗначениеЗаполнено(СокрЛП(ОрганизацияИНН)) Тогда 
			Отказ = Истина;
			Сообщить("ИНН организации должен быть 10 или 12 символов");
		КонецЕсли;
	КонецЕсли;
	
	Если СтрДлина(СокрЛП(КонтрагентИНН)) <> 10 И СтрДлина(СокрЛП(КонтрагентИНН)) <> 12 Тогда 
		Если ЗначениеЗаполнено(СокрЛП(КонтрагентИНН)) Тогда 
			Отказ = Истина;
			Сообщить("ИНН контрагента должен быть 10 или 12 символов");
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаУчастника Из Участники Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрокаУчастника.УчастникИНН)) Тогда 
			Если СтрДлина(СокрЛП(СтрокаУчастника.УчастникИНН)) <> 10 И СтрДлина(СокрЛП(СтрокаУчастника.УчастникИНН)) <> 12 Тогда 
				Отказ = Истина;
				Сообщить("ИНН участника должен быть 10 или 12 символов");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ", ЭтотОбъект, Отказ);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("КонтурЛогистика_Договоры_ПередЗаписью_После", Истина, ПараметрыПМ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Организации = Новый ТаблицаЗначений;
	Организации.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	Организации.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок"));
	Организации.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	ДобавитьСтрокуИННОрганизаций(Организации, ОрганизацияИНН);
	Если ЗначениеЗаполнено(Организация) Тогда
		ИННСправочникаОрганизации = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Организация, "ИНН");
		ДобавитьСтрокуИННОрганизаций(Организации,, Организация);
	Иначе
		ИННСправочникаОрганизации = "";
	КонецЕсли;
	
	ДобавитьСтрокуИННОрганизаций(Организации, КонтрагентИНН);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ИННСправочникаКонтрагент = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Контрагент, "ИНН");
		ДобавитьСтрокуИННОрганизаций(Организации,, Контрагент);
	Иначе
		ИННСправочникаКонтрагент = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(ОрганизацияИНН) И ИННСправочникаОрганизации <> ОрганизацияИНН Тогда
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "ИНН организации не совпадает со значением в карточке";
		ПараметрыСообщения.ПутьКДанным  = "Объект.Организация";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		
		Отказ = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(КонтрагентИНН) И ИННСправочникаКонтрагент <> КонтрагентИНН Тогда
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "ИНН контрагента не совпадает со значением в карточке";
		ПараметрыСообщения.ПутьКДанным  = "Объект.Контрагент";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Участники Цикл
		ДобавитьСтрокуИННОрганизаций(Организации, ТекущаяСтрока.УчастникИНН);
		ДобавитьСтрокуИННОрганизаций(Организации,, ТекущаяСтрока.Участник);
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.УчастникИНН) Или Не ЗначениеЗаполнено(ТекущаяСтрока.Участник) Тогда
			Продолжить;
		КонецЕсли;
		
		ИННУчастиника = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			ТекущаяСтрока.Участник, "ИНН");
		
		Если ИННУчастиника <> ТекущаяСтрока.УчастникИНН Тогда
			ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
			ПараметрыСообщения.Текст = "ИНН участиника " + ТекущаяСтрока.УчастникИНН + " не совпадает со значением в карточке";
			ПараметрыСообщения.ПутьКДанным  = "Объект.Участники";
			
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Организации.Свернуть("ИНН, Организация", "Количество");
	Для Каждого ТекущаяСтрока Из Организации Цикл
		Если ТекущаяСтрока.Количество < 2 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ИНН) Тогда
			ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
			ПараметрыСообщения.Текст = "Есть дубли по ИНН " + ТекущаяСтрока.ИНН;
			
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			
			Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Организация) Тогда
			ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
			ПараметрыСообщения.Текст = "Есть дубли по организации """ + ТекущаяСтрока.Организация + """";
			
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуИННОрганизаций(Организации, ИНН = Неопределено, Организация = Неопределено)
	
	НоваяСтрока = Организации.Добавить();
	НоваяСтрока.ИНН = ИНН;
	НоваяСтрока.Организация = Организация;
	НоваяСтрока.Количество = 1;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ОбъектУчетнойСистемыСсылка")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка) Тогда 
		
		ОбъектУчетнойСистемыСсылка = ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка;
		
		Наименование = Строка(ОбъектУчетнойСистемыСсылка);
		НоваяСвязь = СвязанныеОбъекты.Добавить();
		НоваяСвязь.СвязанныйОбъект = ОбъектУчетнойСистемыСсылка;
		
		Если КонтурЛогистика_КонвертацияСервер.ЭтоНетиповаяСсылкаДляСвязанногоОбъекта(Ссылка, ОбъектУчетнойСистемыСсылка) Тогда
			КонтурЛогистика_КонвертацияСервер.ЗаполнитьДанныеДляНетиповогоСправочникаВСвязанныхОбъектах(НоваяСвязь, ОбъектУчетнойСистемыСсылка)
		КонецЕсли;
		
		// TODO включить после реализации справочника конвертации справочников
		// Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ЗаполнитьСущность(ЭтотОбъект, ОбъектУчетнойСистемыСсылка, Перечисления.КонтурЛогистика_СправочникиКонтурЛогистика);
		
	КонецЕсли;
	
КонецПроцедуры
